#### SpecTypeId Members

---

|  |
| --- |
| SpecTypeId Class   Properties   See Also |

The  SpecTypeId  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | Acceleration | Acceleration, in discipline Structural. |
| Public property Static member | AirFlow | Air Flow, in discipline HVAC. |
| Public property Static member | AirFlowDensity | Air Flow Density, in discipline HVAC. |
| Public property Static member | AirFlowDividedByCoolingLoad | Air Flow divided by Cooling Load, in discipline HVAC. |
| Public property Static member | AirFlowDividedByVolume | Air Flow divided by Volume, in discipline HVAC. |
| Public property Static member | Angle | Angle, in discipline Common. |
| Public property Static member | AngularSpeed | Angular Speed, in discipline HVAC. |
| Public property Static member | ApparentPower | Apparent Power, in discipline Electrical. |
| Public property Static member | ApparentPowerDensity | Apparent Power Density, in discipline Electrical. |
| Public property Static member | Area | Area, in discipline Common. |
| Public property Static member | AreaDividedByCoolingLoad | Area divided by Cooling Load, in discipline HVAC. |
| Public property Static member | AreaDividedByHeatingLoad | Area divided by Heating Load, in discipline HVAC. |
| Public property Static member | AreaForce | Area Force, in discipline Structural. |
| Public property Static member | AreaForceScale | Area Force Scale, in discipline Structural. |
| Public property Static member | AreaSpringCoefficient | Area Spring Coefficient, in discipline Structural. |
| Public property Static member | BarDiameter | Bar Diameter, in discipline Structural. |
| Public property Static member | CableTraySize | Cable Tray Size, in discipline Electrical. |
| Public property Static member | ColorTemperature | Color Temperature, in discipline Electrical. |
| Public property Static member | ConduitSize | Conduit Size, in discipline Electrical. |
| Public property Static member | CoolingLoad | Cooling Load, in discipline HVAC. |
| Public property Static member | CoolingLoadDividedByArea | Cooling Load divided by Area, in discipline HVAC. |
| Public property Static member | CoolingLoadDividedByVolume | Cooling Load divided by Volume, in discipline HVAC. |
| Public property Static member | CostPerArea | Cost per Area, in discipline Common. |
| Public property Static member | CostRateEnergy | Cost Rate Energy, in discipline Electrical. |
| Public property Static member | CostRatePower | Cost Rate Power, in discipline Electrical. |
| Public property Static member | CrackWidth | Crack Width, in discipline Structural. |
| Public property Static member | CrossSection | Cross Section, in discipline HVAC. |
| Public property Static member | Currency | Currency, in discipline Common. |
| Public property Static member | Current | Current, in discipline Electrical. |
| Public property Static member | Custom | Unrecognized custom spec. |
| Public property Static member | DecimalSheetLength | Decimal Sheet Length, in discipline Common. |
| Public property Static member | DemandFactor | Demand Factor, in discipline Electrical. |
| Public property Static member | Diffusivity | Diffusivity, in discipline HVAC. |
| Public property Static member | Displacement | Displacement/Deflection, in discipline Structural. |
| Public property Static member | Distance | Distance, in discipline Common. |
| Public property Static member | DuctInsulationThickness | Duct Insulation Thickness, in discipline HVAC. |
| Public property Static member | DuctLiningThickness | Duct Lining Thickness, in discipline HVAC. |
| Public property Static member | DuctSize | Duct Size, in discipline HVAC. |
| Public property Static member | Efficacy | Efficacy, in discipline Electrical. |
| Public property Static member | ElectricalFrequency | Frequency, in discipline Electrical. |
| Public property Static member | ElectricalPotential | Electrical Potential, in discipline Electrical. |
| Public property Static member | ElectricalPower | Power, in discipline Electrical. |
| Public property Static member | ElectricalPowerDensity | Power Density, in discipline Electrical. |
| Public property Static member | ElectricalResistivity | Electrical Resistivity, in discipline Electrical. |
| Public property Static member | ElectricalTemperature | Temperature, in discipline Electrical. |
| Public property Static member | ElectricalTemperatureDifference | Temperature Difference, in discipline Electrical. |
| Public property Static member | Energy | Energy, in discipline Structural. |
| Public property Static member | Factor | Factor, in discipline HVAC. |
| Public property Static member | Flow | Flow, in discipline Piping. |
| Public property Static member | FlowPerPower | Flow per Power, in discipline HVAC. |
| Public property Static member | Force | Force, in discipline Structural. |
| Public property Static member | ForceScale | Force Scale, in discipline Structural. |
| Public property Static member | HeatCapacityPerArea | Heat Capacity per Area, in discipline Energy. |
| Public property Static member | HeatGain | Heat Gain, in discipline HVAC. |
| Public property Static member | HeatingLoad | Heating Load, in discipline HVAC. |
| Public property Static member | HeatingLoadDividedByArea | Heating Load divided by Area, in discipline HVAC. |
| Public property Static member | HeatingLoadDividedByVolume | Heating Load divided by Volume, in discipline HVAC. |
| Public property Static member | HeatTransferCoefficient | Coefficient of Heat Transfer, in discipline Energy. |
| Public property Static member | HvacDensity | Density, in discipline HVAC. |
| Public property Static member | HvacEnergy | Energy, in discipline Energy. |
| Public property Static member | HvacFriction | Friction, in discipline HVAC. |
| Public property Static member | HvacMassPerTime | Mass per Time, in discipline HVAC. |
| Public property Static member | HvacPower | Power, in discipline HVAC. |
| Public property Static member | HvacPowerDensity | Power Density, in discipline HVAC. |
| Public property Static member | HvacPressure | Pressure, in discipline HVAC. |
| Public property Static member | HvacRoughness | Roughness, in discipline HVAC. |
| Public property Static member | HvacSlope | Slope, in discipline HVAC. |
| Public property Static member | HvacTemperature | Temperature, in discipline HVAC. |
| Public property Static member | HvacTemperatureDifference | Temperature Difference, in discipline HVAC. |
| Public property Static member | HvacVelocity | Velocity, in discipline HVAC. |
| Public property Static member | HvacViscosity | Dynamic Viscosity, in discipline HVAC. |
| Public property Static member | Illuminance | Illuminance, in discipline Electrical. |
| Public property Static member | IsothermalMoistureCapacity | Isothermal Moisture Capacity, in discipline Energy. |
| Public property Static member | Length | Length, in discipline Common. |
| Public property Static member | LinearForce | Linear Force, in discipline Structural. |
| Public property Static member | LinearForceScale | Linear Force Scale, in discipline Structural. |
| Public property Static member | LinearMoment | Linear Moment, in discipline Structural. |
| Public property Static member | LinearMomentScale | Linear Moment Scale, in discipline Structural. |
| Public property Static member | LineSpringCoefficient | Line Spring Coefficient, in discipline Structural. |
| Public property Static member | Luminance | Luminance, in discipline Electrical. |
| Public property Static member | LuminousFlux | Luminous Flux, in discipline Electrical. |
| Public property Static member | LuminousIntensity | Luminous Intensity, in discipline Electrical. |
| Public property Static member | Mass | Mass, in discipline Structural. |
| Public property Static member | MassDensity | Mass Density, in discipline Common. |
| Public property Static member | MassPerUnitArea | Mass per Unit Area, in discipline Structural. |
| Public property Static member | MassPerUnitLength | Mass per Unit Length, in discipline Structural. |
| Public property Static member | Moment | Moment, in discipline Structural. |
| Public property Static member | MomentOfInertia | Moment of Inertia, in discipline Structural. |
| Public property Static member | MomentScale | Moment Scale, in discipline Structural. |
| Public property Static member | Number | Number, in discipline Common. |
| Public property Static member | Period | Period, in discipline Structural. |
| Public property Static member | Permeability | Permeability, in discipline Energy. |
| Public property Static member | PipeDimension | Pipe Dimension, in discipline Piping. |
| Public property Static member | PipeInsulationThickness | Pipe Insulation Thickness, in discipline Piping. |
| Public property Static member | PipeMassPerUnitLength | Mass per Unit Length, in discipline Piping. |
| Public property Static member | PipeSize | Pipe Size, in discipline Piping. |
| Public property Static member | PipingDensity | Density, in discipline Piping. |
| Public property Static member | PipingFriction | Friction, in discipline Piping. |
| Public property Static member | PipingMass | Mass, in discipline Piping. |
| Public property Static member | PipingMassPerTime | Mass per Time, in discipline Piping. |
| Public property Static member | PipingPressure | Pressure, in discipline Piping. |
| Public property Static member | PipingRoughness | Roughness, in discipline Piping. |
| Public property Static member | PipingSlope | Slope, in discipline Piping. |
| Public property Static member | PipingTemperature | Temperature, in discipline Piping. |
| Public property Static member | PipingTemperatureDifference | Temperature Difference, in discipline Piping. |
| Public property Static member | PipingVelocity | Velocity, in discipline Piping. |
| Public property Static member | PipingViscosity | Dynamic Viscosity, in discipline Piping. |
| Public property Static member | PipingVolume | Volume, in discipline Piping. |
| Public property Static member | PointSpringCoefficient | Point Spring Coefficient, in discipline Structural. |
| Public property Static member | PowerPerFlow | Power per Flow, in discipline HVAC. |
| Public property Static member | PowerPerLength | Power per Length, in discipline Electrical. |
| Public property Static member | Pulsation | Pulsation, in discipline Structural. |
| Public property Static member | ReinforcementArea | Reinforcement Area, in discipline Structural. |
| Public property Static member | ReinforcementAreaPerUnitLength | Reinforcement Area per Unit Length, in discipline Structural. |
| Public property Static member | ReinforcementCover | Reinforcement Cover, in discipline Structural. |
| Public property Static member | ReinforcementLength | Reinforcement Length, in discipline Structural. |
| Public property Static member | ReinforcementSpacing | Reinforcement Spacing, in discipline Structural. |
| Public property Static member | ReinforcementVolume | Reinforcement Volume, in discipline Structural. |
| Public property Static member | Rotation | Rotation, in discipline Structural. |
| Public property Static member | RotationalLineSpringCoefficient | Rotational Line Spring Coefficient, in discipline Structural. |
| Public property Static member | RotationalPointSpringCoefficient | Rotational Point Spring Coefficient, in discipline Structural. |
| Public property Static member | RotationAngle | Rotation Angle, in discipline Common. |
| Public property Static member | SectionArea | Section Area, in discipline Structural. |
| Public property Static member | SectionDimension | Section Dimension, in discipline Structural. |
| Public property Static member | SectionModulus | Section Modulus, in discipline Structural. |
| Public property Static member | SectionProperty | Section Property, in discipline Structural. |
| Public property Static member | SheetLength | Sheet Length, in discipline Common. |
| Public property Static member | SiteAngle | Site Angle, in discipline Common. |
| Public property Static member | Slope | Slope, in discipline Common. |
| Public property Static member | SpecificHeat | Specific Heat, in discipline Energy. |
| Public property Static member | SpecificHeatOfVaporization | Specific Heat of Vaporization, in discipline Energy. |
| Public property Static member | Speed | Speed, in discipline Common. |
| Public property Static member | Stationing | Stationing, in discipline Infrastructure. |
| Public property Static member | StationingInterval | Stationing Interval, in discipline Infrastructure. |
| Public property Static member | Stress | Stress, in discipline Structural. |
| Public property Static member | StructuralFrequency | Frequency, in discipline Structural. |
| Public property Static member | StructuralVelocity | Velocity, in discipline Structural. |
| Public property Static member | SurfaceAreaPerUnitLength | Surface Area per Unit Length, in discipline Structural. |
| Public property Static member | ThermalConductivity | Thermal Conductivity, in discipline Energy. |
| Public property Static member | ThermalExpansionCoefficient | Thermal Expansion Coefficient, in discipline Structural. |
| Public property Static member | ThermalGradientCoefficientForMoistureCapacity | Thermal Gradient Coefficient for Moisture Capacity, in discipline Energy. |
| Public property Static member | ThermalMass | Thermal Mass, in discipline Energy. |
| Public property Static member | ThermalResistance | Thermal Resistance, in discipline Energy. |
| Public property Static member | Time | Time, in discipline Common. |
| Public property Static member | UnitWeight | Unit Weight, in discipline Structural. |
| Public property Static member | Volume | Volume, in discipline Common. |
| Public property Static member | WarpingConstant | Warping Constant, in discipline Structural. |
| Public property Static member | Wattage | Wattage, in discipline Electrical. |
| Public property Static member | Weight | Weight, in discipline Structural. |
| Public property Static member | WeightPerUnitLength | Weight per Unit Length, in discipline Structural. |
| Public property Static member | WireDiameter | Wire Diameter, in discipline Electrical. |

# See Also

SpecTypeId Class

Autodesk.Revit.DB Namespace